doggie_daycare/app/views/owners/show.html.erb

<ul>
  <% @owner.dogs.each do |dog| %>
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."owner_id" = ?  [["owner_id", 1]]