doggie_daycare/app/controllers/dogs_controller.rb

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @dog = Dog.find(params[:id])

SELECT "dogs".* FROM "dogs"
SELECT "dogs".* FROM "dogs"  ORDER BY "dogs"."name" ASC
---
  def index
    @dogs = Dog.all
    @order_dogs = Dog.order(:name)

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @dog = Dog.find(params[:id])

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "dogs" SET "owner_id" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["owner_id", 1], ["updated_at", "2016-02-17 15:01:06.561849"], ["id", 1]]
---
  def update
    @dog = Dog.find(params[:id])

    if @dog.update(dog_params)

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 4]]
---
  def destroy
    @dog = Dog.find(params[:id])

    if @dog.destroy

INSERT INTO "dogs" ("name", "breed_id", "age", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fred"], ["breed_id", 5], ["age", 12], ["owner_id", 2], ["created_at", "2016-02-23 03:52:12.806389"], ["updated_at", "2016-02-23 03:52:12.806389"]]
---
  def create
   @dog = Dog.new(dog_params)
   if @dog.save