doggie_daycare/app/controllers/owners_controller.rb

  def index
    @owners = Owner.all
    @order_owners = Owner.order(:name)
---
SELECT "owners".* FROM "owners"
SELECT "owners".* FROM "owners"  ORDER BY "owners"."name" ASC

  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save
---
INSERT INTO "owners" ("name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Steve"], ["phone", "504-955-1234"], ["created_at", "2016-02-17 14:55:16.997057"], ["updated_at", "2016-02-17 14:55:16.997057"]]

    def set_owner
      @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", 1]]