doggie_daycare/app/views/dogs/_form.html.erb

SELECT "breeds".* FROM "breeds"
---
  <%= dog_fields.label :breed_id  %>
  <%= dog_fields.collection_select :breed_id, Breed.all, :id, :name, {prompt: "Select breed"}, {class: "form-control"} %>

SELECT "owners".* FROM "owners"
---
  <%= dog_fields.label :owner_id  %>
  <%= dog_fields.collection_select :owner_id, Owner.all, :id, :name, {prompt: "Select an owner"}, {class: "form-control"} %>